### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [ ]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [1]:
import pandas

In [2]:
dict1 = {
    'Name': ["Muhammad Ayub", "Ibraheem khan", "Muhammad Abid", "Shumail Khan","Qasim Ali"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["1st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"]
}

In [5]:
df = pandas.DataFrame(dict1)

In [7]:
df = pandas.DataFrame(dict1)

In [9]:
df

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [11]:
import pandas as pd

In [13]:
df = pd.DataFrame(dict1)

In [15]:
df

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [17]:
pd.__version__

'2.2.2'

## Import to CSV

In [19]:
df.to_csv('pythonMonday.csv')

## Remove Index

In [21]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [23]:
df.head()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [25]:
df.head()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [27]:
df.tail(3)

            Name  Marks     Class
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [29]:
df.tail()

            Name  Marks     Class
0  Muhammad Ayub     80  1st Year
1  Ibraheem khan     72  2nd Year
2  Muhammad Abid     77  1st Year
3   Shumail Khan     65  3rd Year
4      Qasim Ali     15  2nd Year

In [31]:
df.describe()

           Marks
count   5.000000
mean   61.800000
std    26.771253
min    15.000000
25%    65.000000
50%    72.000000
75%    77.000000
max    80.000000

In [36]:
classData= pd.read_csv("pythonMonday.csv")

In [38]:
classData

   Unnamed: 0           Name  Marks     Class
0           0  Muhammad Ayub     80  1st Year
1           1  Ibraheem khan     72  2nd Year
2           2  Muhammad Abid     77  1st Year
3           3   Shumail Khan     65  3rd Year
4           4      Qasim Ali     15  2nd Year

In [134]:
classData.drop(0, axis=0)

KeyError: '[0] not found in axis'

In [ ]:
classData

In [46]:
classData['Name']

0    Muhammad Ayub
1    Ibraheem khan
2    Muhammad Abid
3     Shumail Khan
4        Qasim Ali
Name: Name, dtype: object

In [52]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [62]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [64]:
classData['Name']

0    Muhammad Ayub
1    Ibraheem khan
2    Muhammad Abid
3     Shumail Khan
4        Qasim Ali
Name: Name, dtype: object

In [72]:
classData['Name']

0    Muhammad Ayub
1    Ibraheem khan
2    Muhammad Abid
3     Shumail Khan
4        Qasim Ali
Name: Name, dtype: object

In [74]:
type(classData['Name'])

pandas.core.series.Series

In [84]:
classData['Marks']

0    80
1    72
2    77
3    65
4    15
Name: Marks, dtype: int64

In [86]:
classData['Marks'][0]

80

In [90]:
classData['Marks'][0]=90

C:\Users\USAMA\AppData\Local\Temp\ipykernel_6780\3766287785.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData['Marks'][0]=90

In [92]:
classData

   Unnamed: 0           Name  Marks     Class
0           0  Muhammad Ayub     90  1st Year
1           1  Ibraheem khan     72  2nd Year
2           2  Muhammad Abid     77  1st Year
3           3   Shumail Khan     65  3rd Year
4           4      Qasim Ali     15  2nd Year

In [96]:
classData['Marks'][4]

15

In [98]:
classData['Marks'][4]=5

C:\Users\USAMA\AppData\Local\Temp\ipykernel_6780\305642868.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData['Marks'][4]=5

In [102]:
classData["Class"][4]="Second Year"

C:\Users\USAMA\AppData\Local\Temp\ipykernel_6780\3056981296.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData["Class"][4]="Second Year"

In [104]:
classData

   Unnamed: 0           Name  Marks        Class
0           0  Muhammad Ayub     90     1st Year
1           1  Ibraheem khan     72     2nd Year
2           2  Muhammad Abid     77     1st Year
3           3   Shumail Khan     65     3rd Year
4           4      Qasim Ali      5  Second Year

In [106]:
classData["Name"][4]

'Qasim Ali'

In [108]:
classData

   Unnamed: 0           Name  Marks        Class
0           0  Muhammad Ayub     90     1st Year
1           1  Ibraheem khan     72     2nd Year
2           2  Muhammad Abid     77     1st Year
3           3   Shumail Khan     65     3rd Year
4           4      Qasim Ali      5  Second Year

In [110]:
classData.to_csv('pythonMondayNew.csv')

In [128]:
classData.to_csv('pythonMondayNewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [130]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [132]:
classData

        Unnamed: 0           Name  Marks        Class
First            0  Muhammad Ayub     90     1st Year
Second           1  Ibraheem khan     72     2nd Year
Third            2  Muhammad Abid     77     1st Year
Fourth           3   Shumail Khan     65     3rd Year
Fifth            4      Qasim Ali      5  Second Year

In [118]:
classData["Name"]["Fifth"]

'Qasim Ali'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [120]:
classData['gpa']

KeyError: 'gpa'

In [84]:
 type(classData['gpa'])

pandas.core.series.Series

In [85]:
classData

                 name     gpa class
First   ibraheem khan   90.00    3rd
Second     tayyab khan   3.45    4th
Third       abbas khan   2.90    5th
Fourth      ayub khan    3.84    6th
Fifth     mobeen khan    5.00    7th

In [86]:
type(classData)

pandas.core.frame.DataFrame

In [87]:
import numpy as np

In [88]:
series1= pd.Series(np.random.rand())

In [89]:
series1

0    0.522558
dtype: float64

In [90]:
series1= pd.Series(np.random.rand(30))

In [91]:
series1

0     0.088123
1     0.376990
2     0.638937
3     0.412943
4     0.827577
5     0.183428
6     0.190390
7     0.116920
8     0.640907
9     0.704741
10    0.635727
11    0.460189
12    0.171821
13    0.984857
14    0.143071
15    0.481433
16    0.912185
17    0.250469
18    0.516642
19    0.471406
20    0.054552
21    0.145239
22    0.452192
23    0.542660
24    0.659164
25    0.513258
26    0.169134
27    0.589750
28    0.057434
29    0.566694
dtype: float64

In [92]:
type(series1)

pandas.core.series.Series

In [93]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [94]:
type(newDf)

pandas.core.frame.DataFrame

In [95]:
newDf

            0         1         2         3         4
0    0.839502  0.992326  0.029421  0.405688  0.591369
1    0.472891  0.937942  0.159810  0.810685  0.054391
2    0.152944  0.616511  0.396288  0.438617  0.898269
3    0.165207  0.528965  0.438421  0.608056  0.621835
4    0.929314  0.993836  0.748688  0.414415  0.318291
..        ...       ...       ...       ...       ...
325  0.195125  0.170877  0.510583  0.102239  0.375501
326  0.633482  0.396583  0.922017  0.109421  0.275757
327  0.771799  0.690224  0.872122  0.080016  0.124429
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

In [96]:
newDf.head(2)

          0         1         2         3         4
0  0.839502  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391

In [97]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [98]:
newDf.tail(2)

            0         1         2         3         4
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

In [99]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [100]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.474401    0.491051    0.504055    0.510265    0.519285
std      0.287771    0.292819    0.284399    0.289879    0.273796
min      0.002309    0.005395    0.002276    0.004599    0.004748
25%      0.222892    0.225936    0.252049    0.261651    0.298324
50%      0.466234    0.487035    0.539522    0.510311    0.514840
75%      0.708121    0.719371    0.742840    0.763619    0.750048
max      0.998524    0.994093    0.997982    0.997387    0.999260

In [101]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [102]:
newDf[0][0]= "Maaz Khan"

In [103]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [104]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.992326  0.029421  0.405688  0.591369
1     0.472891  0.937942  0.159810  0.810685  0.054391
2     0.152944  0.616511  0.396288  0.438617  0.898269
3     0.165207  0.528965  0.438421  0.608056  0.621835
4     0.929314  0.993836  0.748688  0.414415  0.318291
..         ...       ...       ...       ...       ...
325   0.195125  0.170877  0.510583  0.102239  0.375501
326   0.633482  0.396583  0.922017  0.109421  0.275757
327   0.771799  0.690224  0.872122  0.080016  0.124429
328   0.095871  0.423014  0.886492  0.942696  0.302288
329   0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

In [105]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [106]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [107]:
newDf.to_numpy()

array([['Maaz Khan', 0.992325669505626, 0.02942072116575767,
        0.40568774174610434, 0.5913694342372785],
       [0.47289050282962286, 0.9379421199965852, 0.1598100841183442,
        0.8106849450302147, 0.05439072966821579],
       [0.15294353189257015, 0.616511140943471, 0.39628846441091503,
        0.43861741638857854, 0.8982693882049784],
       ...,
       [0.7717990088136402, 0.6902240700421501, 0.8721221200459571,
        0.08001563758755792, 0.1244289084731578],
       [0.09587133710755702, 0.4230140062107982, 0.8864918585477216,
        0.9426963950561333, 0.3022878617993371],
       [0.15575075886502399, 0.09888748894642307, 0.13344316537580603,
        0.8736071830613868, 0.3425754388000314]], dtype=object)

In [108]:
newDf[0][0]=0.30

In [109]:
newDf.head()

          0         1         2         3         4
0       0.3  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

In [110]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.472891,0.152944,0.165207,0.929314,0.439132,0.81581,0.966619,0.891189,0.56634,...,0.092996,0.845014,0.064294,0.273708,0.176336,0.195125,0.633482,0.771799,0.095871,0.155751
1,0.992326,0.937942,0.616511,0.528965,0.993836,0.226901,0.298088,0.185523,0.103625,0.101683,...,0.885138,0.163032,0.727409,0.889973,0.01775,0.170877,0.396583,0.690224,0.423014,0.098887
2,0.029421,0.15981,0.396288,0.438421,0.748688,0.585854,0.808357,0.776844,0.185792,0.787454,...,0.503796,0.590114,0.302077,0.287452,0.819989,0.510583,0.922017,0.872122,0.886492,0.133443
3,0.405688,0.810685,0.438617,0.608056,0.414415,0.375922,0.612956,0.625154,0.370414,0.005102,...,0.990901,0.022772,0.510478,0.445699,0.418852,0.102239,0.109421,0.080016,0.942696,0.873607
4,0.591369,0.054391,0.898269,0.621835,0.318291,0.855481,0.292066,0.281869,0.289675,0.871137,...,0.412267,0.620229,0.587636,0.287449,0.466498,0.375501,0.275757,0.124429,0.302288,0.342575

In [111]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.992326  0.029421  0.405688  0.591369
1    0.472891  0.937942  0.159810  0.810685  0.054391
2    0.152944  0.616511  0.396288  0.438617  0.898269
3    0.165207  0.528965  0.438421  0.608056  0.621835
4    0.929314  0.993836  0.748688  0.414415  0.318291
..        ...       ...       ...       ...       ...
325  0.195125  0.170877  0.510583  0.102239  0.375501
326  0.633482  0.396583  0.922017  0.109421  0.275757
327  0.771799  0.690224  0.872122  0.080016  0.124429
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

In [112]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.155751  0.098887  0.133443  0.873607  0.342575
328  0.095871  0.423014  0.886492  0.942696  0.302288
327  0.771799  0.690224  0.872122  0.080016  0.124429
326  0.633482  0.396583  0.922017  0.109421  0.275757
325  0.195125  0.170877  0.510583  0.102239  0.375501
..        ...       ...       ...       ...       ...
4    0.929314  0.993836  0.748688  0.414415  0.318291
3    0.165207  0.528965  0.438421  0.608056  0.621835
2    0.152944  0.616511  0.396288  0.438617  0.898269
1    0.472891  0.937942  0.159810  0.810685  0.054391
0         0.3  0.992326  0.029421  0.405688  0.591369

[330 rows x 5 columns]

In [113]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.992326  0.029421  0.405688  0.591369
1    0.472891  0.937942  0.159810  0.810685  0.054391
2    0.152944  0.616511  0.396288  0.438617  0.898269
3    0.165207  0.528965  0.438421  0.608056  0.621835
4    0.929314  0.993836  0.748688  0.414415  0.318291
..        ...       ...       ...       ...       ...
325  0.195125  0.170877  0.510583  0.102239  0.375501
326  0.633482  0.396583  0.922017  0.109421  0.275757
327  0.771799  0.690224  0.872122  0.080016  0.124429
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

In [114]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.591369  0.405688  0.029421  0.992326       0.3
1    0.054391  0.810685  0.159810  0.937942  0.472891
2    0.898269  0.438617  0.396288  0.616511  0.152944
3    0.621835  0.608056  0.438421  0.528965  0.165207
4    0.318291  0.414415  0.748688  0.993836  0.929314
..        ...       ...       ...       ...       ...
325  0.375501  0.102239  0.510583  0.170877  0.195125
326  0.275757  0.109421  0.922017  0.396583  0.633482
327  0.124429  0.080016  0.872122  0.690224  0.771799
328  0.302288  0.942696  0.886492  0.423014  0.095871
329  0.342575  0.873607  0.133443  0.098887  0.155751

[330 rows x 5 columns]

In [115]:
newDf.head()

          0         1         2         3         4
0       0.3  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

In [116]:
newDf[0][1]

0.47289050282962286

In [117]:
type(newDf[0])

pandas.core.series.Series

In [118]:
newDf

            0         1         2         3         4
0         0.3  0.992326  0.029421  0.405688  0.591369
1    0.472891  0.937942  0.159810  0.810685  0.054391
2    0.152944  0.616511  0.396288  0.438617  0.898269
3    0.165207  0.528965  0.438421  0.608056  0.621835
4    0.929314  0.993836  0.748688  0.414415  0.318291
..        ...       ...       ...       ...       ...
325  0.195125  0.170877  0.510583  0.102239  0.375501
326  0.633482  0.396583  0.922017  0.109421  0.275757
327  0.771799  0.690224  0.872122  0.080016  0.124429
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

## view

In [119]:
newDfView=newDf

In [120]:
newDfView

            0         1         2         3         4
0         0.3  0.992326  0.029421  0.405688  0.591369
1    0.472891  0.937942  0.159810  0.810685  0.054391
2    0.152944  0.616511  0.396288  0.438617  0.898269
3    0.165207  0.528965  0.438421  0.608056  0.621835
4    0.929314  0.993836  0.748688  0.414415  0.318291
..        ...       ...       ...       ...       ...
325  0.195125  0.170877  0.510583  0.102239  0.375501
326  0.633482  0.396583  0.922017  0.109421  0.275757
327  0.771799  0.690224  0.872122  0.080016  0.124429
328  0.095871  0.423014  0.886492  0.942696  0.302288
329  0.155751  0.098887  0.133443  0.873607  0.342575

[330 rows x 5 columns]

In [121]:
newDfView[0][0]=765

C:\Users\HP\AppData\Local\Temp\ipykernel_10892\4063526219.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDfView[0][0]=765

In [122]:
newDf.head()

          0         1         2         3         4
0       765  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

In [123]:
newDfView.head()

          0         1         2         3         4
0       765  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

In [124]:
newDfCopy=newDf.copy()

In [125]:
newDfCopy[0][0]=656

C:\Users\HP\AppData\Local\Temp\ipykernel_10892\2532441962.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDfCopy[0][0]=656

In [126]:
newDf.head()

          0         1         2         3         4
0       765  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

In [127]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835
4  0.929314  0.993836  0.748688  0.414415  0.318291

## loc

In [128]:
newDf.head(2)

          0         1         2         3         4
0       765  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391

In [129]:
newDf.loc[0,0]

765

In [130]:
newDf.loc[0,0]=5678

In [131]:
newDf.head(2)

          0         1         2         3         4
0      5678  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391

In [132]:
newDf.loc[0,4]

0.5913694342372785

In [133]:
newDf.loc[325,1]

0.17087730222900788

In [134]:
newDf.loc[0,0]=9875

In [135]:
newDf.head(2)

          0         1         2         3         4
0      9875  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391

In [136]:
newDf.columns=list("ABCDE")

In [137]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269

In [138]:
newDf.loc[0, "A"]

9875

In [139]:
newDf.loc[0,"A"]=65

In [140]:
newDf.head(3)

          A         B         C         D         E
0        65  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269

In [141]:
newDf.loc[35,"A"]

0.34404651840383504

In [142]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269
3  0.165207  0.528965  0.438421  0.608056  0.621835

In [143]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.992326  0.029421  0.405688  0.591369
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269

In [144]:
newDf.head(3)

          A         B         C         D         E
0        65  0.992326  0.029421  0.405688  0.591369
1  0.472891  0.937942  0.159810  0.810685  0.054391
2  0.152944  0.616511  0.396288  0.438617  0.898269

In [145]:
newDf = newDf.drop("A", axis=1)

In [146]:
newDf.head(3)

          B         C         D         E
0  0.992326  0.029421  0.405688  0.591369
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269

In [147]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.159810  0.810685
2  0.396288  0.438617

In [148]:
newDf.head(3)

          B         C         D         E
0  0.992326  0.029421  0.405688  0.591369
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269

In [149]:
newDf.loc[:,["C","D"]]

            C         D
0    0.029421  0.405688
1    0.159810  0.810685
2    0.396288  0.438617
3    0.438421  0.608056
4    0.748688  0.414415
..        ...       ...
325  0.510583  0.102239
326  0.922017  0.109421
327  0.872122  0.080016
328  0.886492  0.942696
329  0.133443  0.873607

[330 rows x 2 columns]

In [150]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269

In [151]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.029421  0.405688
1  0.159810  0.810685
2  0.396288  0.438617
3  0.438421  0.608056
4  0.748688  0.414415
5  0.585854  0.375922

In [152]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.937942  0.159810  0.810685
2  0.616511  0.396288  0.438617

In [153]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
5    0.226901  0.585854  0.375922  0.855481
6    0.298088  0.808357  0.612956  0.292066
7    0.185523  0.776844  0.625154  0.281869
8    0.103625  0.185792  0.370414  0.289675
9    0.101683  0.787454  0.005102  0.871137
..        ...       ...       ...       ...
315  0.222196  0.743926  0.424952  0.257754
321  0.163032  0.590114  0.022772  0.620229
324  0.017750  0.819989  0.418852  0.466498
325  0.170877  0.510583  0.102239  0.375501
329  0.098887  0.133443  0.873607  0.342575

[106 rows x 4 columns]

In [154]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
5    0.226901  0.585854  0.375922  0.855481
6    0.298088  0.808357  0.612956  0.292066
7    0.185523  0.776844  0.625154  0.281869
8    0.103625  0.185792  0.370414  0.289675
10   0.286224  0.167519  0.629715  0.656681
..        ...       ...       ...       ...
312  0.190419  0.790646  0.507998  0.751695
313  0.118357  0.291732  0.465498  0.652851
315  0.222196  0.743926  0.424952  0.257754
324  0.017750  0.819989  0.418852  0.466498
329  0.098887  0.133443  0.873607  0.342575

[79 rows x 4 columns]

In [155]:
newDf.head(3)

          B         C         D         E
0  0.992326  0.029421  0.405688  0.591369
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269

## iloc

In [156]:
newDf.iloc[0,0]

0.992325669505626

In [157]:
newDf.iloc[0,0]=555

In [158]:
newDf.head()

            B         C         D         E
0  555.000000  0.029421  0.405688  0.591369
1    0.937942  0.159810  0.810685  0.054391
2    0.616511  0.396288  0.438617  0.898269
3    0.528965  0.438421  0.608056  0.621835
4    0.993836  0.748688  0.414415  0.318291

In [159]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.029421  0.591369
4  0.748688  0.318291

In [160]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.029421  0.405688  0.591369
1    0.937942  0.159810  0.810685  0.054391
2    0.616511  0.396288  0.438617  0.898269
3    0.528965  0.438421  0.608056  0.621835

In [161]:
newDf.drop(0).head()

          B         C         D         E
1  0.937942  0.159810  0.810685  0.054391
2  0.616511  0.396288  0.438617  0.898269
3  0.528965  0.438421  0.608056  0.621835
4  0.993836  0.748688  0.414415  0.318291
5  0.226901  0.585854  0.375922  0.855481

In [162]:
# newDf.drop(0, axis=1)

In [163]:
# newDf.drop("B", axis=1).head()

In [164]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.591369
1    0.937942  0.054391
2    0.616511  0.898269
3    0.528965  0.621835
4    0.993836  0.318291

In [165]:
newDf.head()

            B         C         D         E
0  555.000000  0.029421  0.405688  0.591369
1    0.937942  0.159810  0.810685  0.054391
2    0.616511  0.396288  0.438617  0.898269
3    0.528965  0.438421  0.608056  0.621835
4    0.993836  0.748688  0.414415  0.318291

In [166]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [167]:
newDf.head()

          C         E
0  0.029421  0.591369
1  0.159810  0.054391
2  0.396288  0.898269
3  0.438421  0.621835
4  0.748688  0.318291

In [168]:
newDf.reset_index().head()

   index         C         E
0      0  0.029421  0.591369
1      1  0.159810  0.054391
2      2  0.396288  0.898269
3      3  0.438421  0.621835
4      4  0.748688  0.318291

In [163]:
newDf.reset_index(drop=True).head()

          C         E
0  0.870811  0.034058
1  0.209813  0.851167
2  0.781053  0.239450
3  0.940346  0.008776
4  0.409709  0.279607

In [164]:
newDf.head()

          C         E
0  0.870811  0.034058
1  0.209813  0.851167
2  0.781053  0.239450
3  0.940346  0.008776
4  0.409709  0.279607

In [167]:
newDf.reset_index(drop=True, inplace=True)

In [168]:
newDf.head()

          C         E
0  0.870811  0.034058
1  0.209813  0.851167
2  0.781053  0.239450
3  0.940346  0.008776
4  0.409709  0.279607

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [6]:
df.groupby('Company')

##### You can save this object as a new variable:

In [7]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [8]:
by_comp.mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_960\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
df.groupby('Company').mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_960\2058252646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
by_comp.std()

C:\Users\HP\AppData\Local\Temp\ipykernel_960\3391457442.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [12]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [13]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0